import classes from "./howtoplay.module.scss";

function Howtoplay() {
  return (
    <div className={classes.main}>
      <h1>Як грати у гру 2048</h1>
      <p>
        2048 - це гра, в якій потрібно збирати блоки з числами, щоб отримати
        блок із числом 2048.
      </p>
      <h2>Як грати</h2>
      <ul>
        <li>Клікніть на блок, щоб його вибрати.</li>
        <li>
          Використовуйте стрілки на клавіатурі, щоб рухати блоки вгору, вниз,
          вліво або вправо.
        </li>
        <li>
          Кожен раз, коли два блоки з однаковим числом зустрічаються, вони
          об'єднуються в один блок з числом, що дорівнює їхній сумі.
        </li>
        <li>Мета полягає в тому, щоб зібрати блок із числом 2048.</li>
      </ul>
      <h2>Підказки</h2>
      <ul>
        <li>Не залишайте вільних полів занадто багато.</li>
        <li>
          Спробуйте об'єднувати блоки так, щоб на полі залишилося якомога менше
          чисел.
        </li>
      </ul>
      <p>Граємо і весело проводимо час!</p>
    </div>
  );
}

export default Howtoplay;
